{
  "class_name": "Functional",
  "config": {
    "name": "model",
    "trainable": true,
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            4
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_1"
        },
        "registered_name": null,
        "name": "input_1",
        "inbound_nodes": []
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": "float32",
          "units": 16,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            4
          ]
        },
        "name": "dense_1",
        "inbound_nodes": [
          [
            [
              "input_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Activation",
        "config": {
          "name": "activation_1",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            16
          ]
        },
        "name": "activation_1",
        "inbound_nodes": [
          [
            [
              "dense_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "trainable": true,
          "dtype": "float32",
          "units": 16,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            16
          ]
        },
        "name": "dense_2",
        "inbound_nodes": [
          [
            [
              "activation_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Activation",
        "config": {
          "name": "activation_2",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            16
          ]
        },
        "name": "activation_2",
        "inbound_nodes": [
          [
            [
              "dense_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_3",
          "trainable": true,
          "dtype": "float32",
          "units": 16,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            16
          ]
        },
        "name": "dense_3",
        "inbound_nodes": [
          [
            [
              "activation_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Activation",
        "config": {
          "name": "activation_3",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            16
          ]
        },
        "name": "activation_3",
        "inbound_nodes": [
          [
            [
              "dense_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_4",
          "trainable": true,
          "dtype": "float32",
          "units": 2,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            16
          ]
        },
        "name": "dense_4",
        "inbound_nodes": [
          [
            [
              "activation_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Activation",
        "config": {
          "name": "activation_4",
          "trainable": true,
          "dtype": "float32",
          "activation": "softmax"
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            2
          ]
        },
        "name": "activation_4",
        "inbound_nodes": [
          [
            [
              "dense_4",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_1",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "activation_4",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.15.0",
  "backend": "tensorflow"
}